## Plan Result (883: prod_landing - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 14 to add, 2 to change, 5 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.roles[&#34;00-ingest00-logic-prod-User-Owner-Isabella.O&#39;Hara@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-main-prod-User-Owner-Isabella.O&#39;Hara@hmcts.net&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-network-prod-User-Owner-Isabella.O&#39;Hara@hmcts.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
* Update
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;sftp&#34;].azurerm_storage_account.storage_account
* Replace
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].time_static.pim_expiry




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.roles["00-ingest00-logic-prod-User-Owner-Isabella.O'Hara@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ee04ad38-e56e-40e3-a998-40eb586c4c74"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-logic-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-main-prod-User-Owner-Isabella.O'Hara@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ee04ad38-e56e-40e3-a998-40eb586c4c74"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-network-prod-User-Owner-Isabella.O'Hara@hmcts.net"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ee04ad38-e56e-40e3-a998-40eb586c4c74"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_database.this["MetadataControl"] will be updated in-place
  ~ resource "azurerm_mssql_database" "this" {
      ~ auto_pause_delay_in_minutes                                = 0 -> -1
        id                                                         = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-prod/databases/MetadataControl"
        name                                                       = "MetadataControl"
        tags                                                       = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["curated"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["curated"].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 16 -> (known after apply)
      ~ hour    = 9 -> (known after apply)
      ~ id      = "2025-05-16T09:54:46Z" -> (known after apply)
      ~ minute  = 54 -> (known after apply)
      ~ month   = 5 -> (known after apply)
      ~ rfc3339 = "2025-05-16T09:54:46Z" -> (known after apply) # forces replacement
      ~ second  = 46 -> (known after apply)
      ~ unix    = 1747389286 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["external"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["external"].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 16 -> (known after apply)
      ~ hour    = 9 -> (known after apply)
      ~ id      = "2025-05-16T09:54:46Z" -> (known after apply)
      ~ minute  = 54 -> (known after apply)
      ~ month   = 5 -> (known after apply)
      ~ rfc3339 = "2025-05-16T09:54:46Z" -> (known after apply) # forces replacement
      ~ second  = 46 -> (known after apply)
      ~ unix    = 1747389286 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["landing"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["landing"].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 16 -> (known after apply)
      ~ hour    = 9 -> (known after apply)
      ~ id      = "2025-05-16T09:54:46Z" -> (known after apply)
      ~ minute  = 54 -> (known after apply)
      ~ month   = 5 -> (known after apply)
      ~ rfc3339 = "2025-05-16T09:54:46Z" -> (known after apply) # forces replacement
      ~ second  = 46 -> (known after apply)
      ~ unix    = 1747389286 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["raw"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["raw"].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 16 -> (known after apply)
      ~ hour    = 9 -> (known after apply)
      ~ id      = "2025-05-16T09:54:46Z" -> (known after apply)
      ~ minute  = 54 -> (known after apply)
      ~ month   = 5 -> (known after apply)
      ~ rfc3339 = "2025-05-16T09:54:46Z" -> (known after apply) # forces replacement
      ~ second  = 46 -> (known after apply)
      ~ unix    = 1747389286 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["sftp"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00sftpprod"
        name                               = "ingest00sftpprod"
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

      ~ blob_properties {
            # (5 unchanged attributes hidden)

          - cors_rule {
              - allowed_headers    = [
                  - "*",
                ] -> null
              - allowed_methods    = [
                  - "DELETE",
                  - "GET",
                  - "HEAD",
                  - "MERGE",
                  - "POST",
                  - "OPTIONS",
                  - "PUT",
                  - "PATCH",
                ] -> null
              - allowed_origins    = [
                  - "https://documentintelligence.ai.azure.com",
                ] -> null
              - exposed_headers    = [
                  - "*",
                ] -> null
              - max_age_in_seconds = 120 -> null
            }

            # (2 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 16 -> (known after apply)
      ~ hour    = 9 -> (known after apply)
      ~ id      = "2025-05-16T09:54:46Z" -> (known after apply)
      ~ minute  = 54 -> (known after apply)
      ~ month   = 5 -> (known after apply)
      ~ rfc3339 = "2025-05-16T09:54:46Z" -> (known after apply) # forces replacement
      ~ second  = 46 -> (known after apply)
      ~ unix    = 1747389286 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSVMBootstrap"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Compute"
      + tags                        = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "production"
          + "startupMode"         = "always"
        }
      + type                        = "CustomScriptExtension"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Compute/virtualMachines/ingest00-legacy-sql-prod"
    }

Plan: 14 to add, 2 to change, 5 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.data_landing_zone["00"].module.storage["curated"].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2024-05-21T09:54:46Z"
      - rotation_rfc3339 = "2025-05-16T09:54:46Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.storage["external"].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2024-05-21T09:54:46Z"
      - rotation_rfc3339 = "2025-05-16T09:54:46Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.storage["landing"].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2024-05-21T09:54:46Z"
      - rotation_rfc3339 = "2025-05-16T09:54:46Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.storage["raw"].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2024-05-21T09:54:46Z"
      - rotation_rfc3339 = "2025-05-16T09:54:46Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2024-05-21T09:54:46Z"
      - rotation_rfc3339 = "2025-05-16T09:54:46Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":95,"Program":"tfcmt","SHA1":"","Target":"883: prod_landing - TerraformPlanApply","Vars":{}} -->